In [ ]:
# pandas library
# pandas library is used for reading and processing data - process tabular data
# In data science, we deal with large amounts of data
# .csv, mostly rows and columns, pictorial forms

In [1]:
import os # module - file
# the os module is used to interact with the operating system

os.chdir('C:/Users/LIKHITA/Desktop/new_csv')

In [12]:
import pandas as pd
df = pd.pandas.read_csv('e-commerce_data.csv') # comma separated value

# here df stands for data frame - most important datastructure in pandas
# similar to how array is most import data structure in numpy

In [13]:
df # visualization of dataframe in rows and cols - dataframe can be thought of as a table

                                           Review Text  Recommended
0    Absolutely wonderful - silky and sexy and comf...            1
1    Love this dress!  it's sooo pretty.  i happene...            1
2    I had such high hopes for this dress and reall...            0
3    I love, love, love this jumpsuit. it's fun, fl...            0
4    This shirt is very flattering to all due to th...            0
..                                                 ...          ...
894  Cute jeans! flattering and slimming. tts. the ...            1
895  Love it! the pants is absolutely beautiful, ri...            1
896  I loved this dress and it fit great on me: 5'7...            0
897  This coat is gorgeous but it runs huge! i am t...            1
898  Purchased these jeans in a 27 and i am usually...            1

[899 rows x 2 columns]

In [14]:
df['Recommended'].max() 

# square brackets are used for retrieving the column value

1

In [8]:
df['Review Text'][df['Recommended'] == 1] # filtering out all the positive reviews

# the second part is the boolean expression

0      Absolutely wonderful - silky and sexy and comf...
1      Love this dress!  it's sooo pretty.  i happene...
11     This dress is perfection! so pretty and flatte...
12     More and more i find myself reliant on the rev...
13     Bought the black xs to go under the larkspur m...
                             ...
892    Sits at waist, length is perfect for petite, q...
894    Cute jeans! flattering and slimming. tts. the ...
895    Love it! the pants is absolutely beautiful, ri...
897    This coat is gorgeous but it runs huge! i am t...
898    Purchased these jeans in a 27 and i am usually...
Name: Review Text, Length: 639, dtype: object

In [11]:
# average - .mean()

# df['WindSpeedMPH'].mean()

In [ ]:
# dataframe is a datastructure of pandas that stores data in the form tables
# read_csv is afunction inside my pandas library

In [16]:
weather_data = [('1/1/2017',32,6,'Rain'),
               ('1/2/2017',35,7,'Sunny'),
               ('1/3/2017',28,2,'Snow'),
               ('1/4/2017',24, 7,'Snow'),
               ('1/5/2017',32,4,'Rain'),
               ('1/6/2017',31,2,'Sunny')]

# to create a dataframe - a list of tuples

# a new_df object is being created by calling the DataFrame constructor
#obj = Class()

new_df = pd.DataFrame(weather_data, columns = ['day','temperature','windspeed','description'])

new_df

        day  temperature  windspeed description
0  1/1/2017           32          6        Rain
1  1/2/2017           35          7       Sunny
2  1/3/2017           28          2        Snow
3  1/4/2017           24          7        Snow
4  1/5/2017           32          4        Rain
5  1/6/2017           31          2       Sunny

In [17]:
new_df.shape # shape attribute gives the dimensions of the dataframe ie the number of rows X columns 

 #(rows, cols)

(6, 4)

In [ ]:
# df is a DataFrame object
# You can perform various operations on this DataFrame,
#  using DataFrame methods and attributes.

# a dataframe object is created from Dataframe class
# this dataframe class is present in pandas.DataFrame
# since a class has methods and variables, every time an object of dataframe is created, its methods and varaibles
# are retrieved from DataFrame class

In [18]:
print(type(new_df)) # class dataFrame present in pandas library, in core in frame

<class 'pandas.core.frame.DataFrame'>

In [22]:
new_df.head() # prints the top 5 rows
# new_df.tail() # prints the bottom 5 rows

        day  temperature  windspeed description
0  1/1/2017           32          6        Rain
1  1/2/2017           35          7       Sunny
2  1/3/2017           28          2        Snow
3  1/4/2017           24          7        Snow
4  1/5/2017           32          4        Rain

In [21]:
# slicing rows
df[0:4] # the last index not included

                                         Review Text  Recommended
0  Absolutely wonderful - silky and sexy and comf...            1
1  Love this dress!  it's sooo pretty.  i happene...            1
2  I had such high hopes for this dress and reall...            0
3  I love, love, love this jumpsuit. it's fun, fl...            0

In [23]:
# get list of columns
new_df.columns

Index(['day', 'temperature', 'windspeed', 'description'], dtype='object')

In [24]:
# accessing columns
# first way - dot notation

new_df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [25]:
# second way - bracket notation
new_df['windspeed']

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64

In [26]:
# data from two columns

new_df[['windspeed','description','day']]

   windspeed description       day
0          6        Rain  1/1/2017
1          7       Sunny  1/2/2017
2          2        Snow  1/3/2017
3          7        Snow  1/4/2017
4          4        Rain  1/5/2017
5          2       Sunny  1/6/2017

In [27]:
# max temp
new_df['temperature'].min()

24

In [28]:
new_df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [32]:
new_df[new_df['temperature'] == new_df['temperature'].max()]
#df[rows] rows - with max temmperature

        day  temperature  windspeed description
1  1/2/2017           35          7       Sunny

In [ ]:
# filtered_df = df[(df['temperature'] > 25) & (df['windspeed'] < 10)]

In [ ]:
# to upload data and work with it - csv files and xls files
# csv - comma separated files
# xls files - microsoft excel files - .xls or .xlsx

In [33]:
new_df
# here 0,1,2,3,4 are called the index of the dataframe object

        day  temperature  windspeed description
0  1/1/2017           32          6        Rain
1  1/2/2017           35          7       Sunny
2  1/3/2017           28          2        Snow
3  1/4/2017           24          7        Snow
4  1/5/2017           32          4        Rain
5  1/6/2017           31          2       Sunny

# Read csv and excel files

In [34]:
# to read from xls file - pip install xlrd - excel read (xlrd)
# but now the latest versions don't require installation of xlrd

# pandas library has read_excel() method

import os # os is a module that lets me access the operating system 

os.chdir('C:/Users/LIKHITA/Desktop/new_csv')

df1 = pd.read_excel('file_example_XLS_10.xls')
df1

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [35]:
df1['Id'].max()

6548

In [ ]:
# older excel versions use .xls
# now excel uses .xlsx extension

In [37]:
list_data = [(12,"likhita",19,"CSE"),
     (16,"Vikyath",18,"MECH"),
     (11,"Reynold",20,"CIVIL"),
     (20,"Simha",21,"IT")]

# creating a dataframe object - table - using a constructor
df = pd.DataFrame(list_data, columns = ['sid','name','age','branch'])
df

   sid     name  age branch
0   12  likhita   19    CSE
1   16  Vikyath   18   MECH
2   11  Reynold   20  CIVIL
3   20    Simha   21     IT

In [38]:
os.chdir('C:/Users/LIKHITA/Desktop/new_csv')

# dataframes usually consist of index value - which also gets added into the csv file - 
# the index is the first column of the dataframe

df.to_csv('student.csv') # a new csv file is created in the given folder
# here the index value is also included in the csv file

In [40]:
new_data2 = [(25,"rohan",18,"ECE")]

from pandas import DataFrame as dfa

df3 = dfa(new_data2)

df3

    0      1   2    3
0  25  rohan  18  ECE

In [41]:
df3.to_csv('student.csv')

# the to_csv method doesn't append to the existing data, it overwrites the existing data.

In [43]:
# to store a dataframe to a csv file without indexes

# to_csv - function -  python functions have default parameters and stuff

df.to_csv("without_index_student.csv",index = False )

In [46]:
# to load data to excel sheet, i have to pip install openpyxl (open python excel)

df1.to_excel('person.xlsx',sheet_name = 'persons')

# this creates a sheet in excel called persons and a new file called persons in the existing directory
# the xls extension is not working

# we know that a single excel file has multiple sheets - so we insert the dataframe in the desired sheet

# group by function

In [ ]:
# the groupby function of dataframe object - works similar to how group by function in sql works - groups data based on 
# a specific attribute or column like city, color, branch

In [51]:
country_group = df1.groupby('Country') 

country_group

In [54]:
df1

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [56]:
for x,y in country_group:
    print(x)

# the country_group has two parts
# x = all the groups
# y = all the rows that belong to the group

France
Great Britain
United States

In [57]:
for x,y in country_group:
    print(x)
    print(y)
    
# the print(y) prints the different rows under each group
# here the index acts as a row number or a unique id or an index of an arrray starting with 0 to uniquely indentify each row

France
   0 First Name Last Name Gender Country  Age        Date    Id
2  3     Philip      Gent   Male  France   36  21/05/2015  2587
Great Britain
   0 First Name  Last Name  Gender        Country  Age        Date    Id
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
United States
   0 First Name Last Name  Gender        Country  Age        Date    Id
0  1      Dulce     Abril  Female  United States   32  15/10/2017  1562
3  4   Kathleen    Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston     Brumm    Male  United States   24  21/05/2015  2554
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

In [59]:
date_group = df1.groupby('Date')
for l,m in date_group:
    print(l)

15/10/2017
16/08/2016
21/05/2015

In [60]:
country_group.get_group('United States')
# the get group funtion gets a specific group

   0 First Name Last Name  Gender        Country  Age        Date    Id
0  1      Dulce     Abril  Female  United States   32  15/10/2017  1562
3  4   Kathleen    Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston     Brumm    Male  United States   24  21/05/2015  2554
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

In [61]:
# find max age in each country
# applying aggregate functions with group by

country_group.max()

# the max function retieves the max value in each attribute - for every group =

               0 First Name Last Name  Gender  Age        Date    Id
Country
France         3     Philip      Gent    Male   36  21/05/2015  2587
Great Britain  7       Mara      Hurn  Female   56  16/08/2016  3598
United States  9   Vincenza   Weiland    Male   58  21/05/2015  6548

In [64]:
country_group.mean()

# since average function can only be used for numerical attributes, we only consider numerical attributes

C:\Users\LIKHITA\AppData\Local\Temp\ipykernel_3632\802841930.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  country_group.mean()

                 0        Age      Id
Country
France         3.0  36.000000  2587.0
Great Britain  4.5  40.500000  2590.0
United States  5.5  34.333333  3189.5

In [66]:
# describe methods - gets information about each group

print(country_group.describe())

# again it can be observed that these numerical calculations are only done on Age and Id

                  0                                             Age  \
              count mean       std  min   25%  50%   75%  max count
Country
France          1.0  3.0       NaN  3.0  3.00  3.0  3.00  3.0   1.0
Great Britain   2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0   2.0
United States   6.0  5.5  2.880972  1.0  4.25  5.5  7.50  9.0   6.0

                          ...                 Id                               \
                    mean  ...    75%   max count    mean          std     min
Country                   ...
France         36.000000  ...  36.00  36.0   1.0  2587.0          NaN  2587.0
Great Britain  40.500000  ...  48.25  56.0   2.0  2590.0  1425.527271  1582.0
United States  34.333333  ...  38.00  58.0   6.0  3189.5  1761.815172  1562.0


                  25%     50%      75%     max
Country
France         2587.0  2587.0  2587.00  2587.0
Great Britain  2086.0  2590.0  3094.00  3598.0
United States  2459.0  2511.0  3300.25  6548.0

[3 rows x 24 columns]

# Concatenate data frames

In [73]:
# consider two dataframes - rather than overriwriting data to a file from a dataframe.
# we are concatenating two dataframes
# similar to union operation in sql

india_weather = dfa({
    "city" :["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity": [80,60,78]
})
# here dataframe is being represented in the form of a hashmap or a (dictionary - python) - key, value pairs

usa_weather = dfa({
    "city":["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68,65,75]
    
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [74]:
usa_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [75]:
# concat is a pandas method used for concatentation of two dataframes
#india_weather = pd.concat([india_weather,usa_weather]) - new_var = old_var modified

new_dataframe = pd.concat([india_weather,usa_weather]) # adding into new dataframe
new_dataframe

# notice that the row numbers or indices are getting copied here

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [76]:
# to get continuous index

new_dataframe = pd.concat([india_weather,usa_weather],ignore_index = True)
new_dataframe

# here continous index is being obtained

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [77]:
# to merge data horizontally rather than vertically - we can use the axis argument

new_dataframe2 = pd.concat([india_weather,usa_weather],axis = 1)
new_dataframe2

        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           21        68
1      delhi           45        60   chicago           14        65
2  bangalore           30        78   orlando           35        75